<?php
namespace Database\Seeders;
use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
class PermissionTableSeeder extends Seeder
{
/**
* Run the database seeds.
*
* @return void
*/
public function run()
{
$permissions = [
    'اضافة اذن موظف',
    'تعديل اذن موظف',
    'عرض اذن موظف',
    'حذف اذن موظف',


    'اضافة اذن طالب',
    'تعديل اذن طالب',
    'عرض اذن طالب',
    'حذف اذن طالب',
    'اضافة اذن معلم',
    'تعديل اذن معلم',
    'عرض اذن معلم',
    'حذف اذن معلم',


    'اضافة ارشيف',
    'تعديل ارشيف',
    'عرض ارشيف',
    'حذف ارشيف',


    'اضافة صندوق',
    'تعديل صندوق',
    'عرض صندوق',
    'حذف صندوق',


    'اضافة صادر صندوق',
    'تعديل صادر صندوق',
    'عرض صادر صندوق',
    'حذف صادر صندوق',

    'اضافة ايراد صندوق',
    'تعديل ايراد صندوق',
    'عرض ايراد صندوق',
    'حذف ايراد صندوق',


    'اضافة حملة',
    'تعديل حملة',
    'عرض حملة',
    'حذف حملة',

    'اضافة متابعة حملة',
    'تعديل متابعة حملة',
    'عرض متابعة حملة',
    'حذف متابعة حملة',

    'اضافة قبض دورة',
    'تعديل قبض دورة',
    'عرض قبض دورة',
    'حذف قبض دورة',

    'اضافة قبض صندوق',
    'تعديل قبض صندوق',
    'عرض قبض صندوق',
    'حذف قبض صندوق',

    'اضافة شهادة',
    'تعديل شهادة',
    'عرض شهادة',
    'حذف شهادة',

    'اضافة متابعة طلاب',
    'تعديل متابعة طلاب',
    'عرض متابعة طلاب',
    'حذف متابعة طلاب',

    'اضافة مطالبة',
    'تعديل مطالبة',
    'عرض مطالبة',
    'حذف مطالبة',

    'اضافة مطالبة قانونية',
    'تعديل مطالبة قانونية',
    'عرض مطالبة قانونية',
    'حذف مطالبة قانونية',

    'اضافة دورة',
    'تعديل دورة',
    'عرض دورة',
    'حذف دورة',


    'اضافة موظف',
    'تعديل موظف',
    'عرض موظف',
    'حذف موظف',

    'اضافة فحص انجليزي',
    'تعديل فحص انجليزي',
    'عرض فحص انجليزي',
    'حذف فحص انجليزي',

    'اضافة  تسجيل انجليزي',
    'تعديل  تسجيل انجليزي',
    'عرض  تسجيل انجليزي',
    'حذف  تسجيل انجليزي',

    'اضافة شؤون قانونية',
    'تعديل شؤون قانونية',
    'عرض شؤون قانونية',
    'حذف شؤون قانونية',


    'اضافة نجاح انجليزي',
    'تعديل نجاح انجليزي',
    'عرض نجاح انجليزي',
    'حذف نجاح انجليزي',


    'اضافة صنف',
    'تعديل صنف',
    'عرض صنف',
    'حذف صنف',


    'اضافة قائمة',
    'تعديل قائمة',
    'عرض قائمة',
    'حذف قائمة',



    'اضافة سنة مالية',
    'تعديل سنة مالية',
    'عرض سنة مالية',
    'حذف سنة مالية',



    'اضافة عروض دورات',
    'تعديل عروض دورات',
    'عرض عروض دورات',
    'حذف عروض دورات',



    'اضافة خيارات',
    'تعديل خيارات',
    'عرض خيارات',
    'حذف خيارات',



    'اضافة كميات',
    'تعديل كميات',
    'عرض كميات',
    'حذف كميات',



    'اضافة موعد حصة',
    'تعديل موعد حصة',
    'عرض موعد حصة',
    'حذف موعد حصة',


    'اضافة صرف سلفة',
    'تعديل صرف سلفة',
    'عرض صرف سلفة',
    'حذف صرف سلفة',


    'اضافة  صرف صندوق',
    'تعديل  صرف صندوق',
    'عرض  صرف صندوق',
    'حذف  صرف صندوق',


    'اضافة صرف دورة',
    'تعديل صرف دورة',
    'عرض صرف دورة',
    'حذف صرف دورة',



    'اضافة صرف مكافأة',
    'تعديل صرف مكافأة',
    'عرض صرف مكافأة',
    'حذف صرف مكافأة',



    'اضافة صرف راتب',
    'تعديل صرف راتب',
    'عرض صرف راتب',
    'حذف صرف راتب',



    'اضافة صرف مخالصة',
    'تعديل صرف مخالصة',
    'عرض صرف مخالصة',
    'حذف صرف مخالصة',



    'اضافة صرف ضمان',
    'تعديل صرف ضمان',
    'عرض صرف ضمان',
    'حذف صرف ضمان',



    'اضافة مستودع',
    'تعديل مستودع',
    'عرض مستودع',
    'حذف مستودع',



    'اضافة  قبض مستودع',
    'تعديل  قبض مستودع',
    'عرض  قبض مستودع',
    'حذف  قبض مستودع',


    'اضافة صرف مستودع',
    'تعديل صرف مستودع',
    'عرض صرف مستودع',
    'حذف صرف مستودع',


    'اضافة اقسام مستودع',
    'تعديل اقسام مستودع',
    'عرض اقسام مستودع',
    'حذف اقسام مستودع',



    'اضافة راتب',
    'تعديل راتب',
    'عرض راتب',
    'حذف راتب',



    'اضافة طالب',
    'تعديل طالب',
    'عرض طالب',
    'حذف طالب',



    'اضافة  تسجيل بالدورة',
    'تعديل  تسجيل بالدورة',
    'عرض  تسجيل بالدورة',
    'حذف  تسجيل بالدورة',



    'اضافة مهمة',
    'تعديل مهمة',
    'عرض مهمة',
    'حذف مهمة',



    'اضافة معلم',
    'تعديل معلم',
    'عرض معلم',
    'حذف معلم',


    'اضافة مستخدم',
    'تعديل مستخدم',
    'عرض مستخدم',
    'حذف مستخدم',


    'اضافة انسحاب',
    'تعديل انسحاب',
    'عرض انسحاب',
    'حذف انسحاب',


];
foreach ($permissions as $permission) {
Permission::create(['name' => $permission]);
}
}
}
